<a href="https://colab.research.google.com/github/asrarbhat/machineleanring/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

pandas for me

In [81]:
import pandas as pd
import numpy as np

In [82]:
df=pd.read_csv("life.csv")
df

   name  usn  class
0    hi    1      5
1  how     2      6
2  are     3      7
3   you    4      8

In [83]:
df.columns=['rayon','is','bitch']
df

  rayon  is  bitch
0    hi   1      5
1  how    2      6
2  are    3      7
3   you   4      8

In [84]:
df.index=[1,2,3,4]
df

  rayon  is  bitch
1    hi   1      5
2  how    2      6
3  are    3      7
4   you   4      8

In [85]:
df["sum"]=1
df

  rayon  is  bitch  sum
1    hi   1      5    1
2  how    2      6    1
3  are    3      7    1
4   you   4      8    1

In [86]:
df.drop("is",axis=1,inplace=True)
df

  rayon  bitch  sum
1    hi      5    1
2  how       6    1
3  are       7    1
4   you      8    1

In [87]:
df.loc[5]=["hey",6,6]
df
# len(df)

  rayon  bitch  sum
1    hi      5    1
2  how       6    1
3  are       7    1
4   you      8    1
5   hey      6    6

In [88]:
df.drop(2,inplace=True)

In [89]:
df.index=[int(x) for x in range(len(df))]
df

  rayon  bitch  sum
0    hi      5    1
1  are       7    1
2   you      8    1
3   hey      6    6

In [90]:
df[df['rayon']=="hello"]

Empty DataFrame
Columns: [rayon, bitch, sum]
Index: []

In [91]:
df

  rayon  bitch  sum
0    hi      5    1
1  are       7    1
2   you      8    1
3   hey      6    6

In [92]:
df.rename(columns={"rayon":"word","bitch":"salary","sum":"children"},inplace=True)

In [94]:
df

   word  salary  children
0    hi       5         1
1  are        7         1
2   you       8         1
3   hey       6         6

In [103]:
s=df["word"]
s=s=='hi'
df["word"][s]='hey'
df

/tmp/ipykernel_95431/3235323303.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["word"][s]='hey'

   word  salary  children
0   hey       5         1
1  are        7         1
2   you       8         1
3   hey       6         6

In [110]:
df['children']=(df['salary']-np.mean(df['salary']))/np.std(df['salary'])
df
df.values

array([['hey', -1.3416407864998738, -1.3416407864998738],
       ['are ', 0.4472135954999579, 0.4472135954999579],
       ['you', 1.3416407864998738, 1.3416407864998738],
       ['hey', -0.4472135954999579, -0.4472135954999579]], dtype=object)